docs/book-notes/CSP/CSP.org
#+html_head: <link rel="stylesheet" href="../../css/org-page.css"/>
#+property: tangle CSP.jo
#+title: Communicating Sequential Processes

- by C. A. R. Hoare

* 1 Processes

*** 1.1  Introduction

    - the word 'process' stand for
      the behaviour pattern of an object,
      insofar as it can be described
      in terms of the limited set of events
      selected as its alphabet.

    - prefix -
      (x : event) (P : process)
      (x -> P) -- pronounced "x then P"

      - x -
        #+begin_src jojo
        (+process CLOCK (- tick CLOCK))
        (+process VMS (- coin choc VMS))
        #+end_src

    - choice -
      (x -> P | y -> Q)
      The bar | should be pronounced "choice"
      "x then P choice y then Q"

      - x -
        #+begin_src jojo
        (+process CH5C
          (- in5p
             (| out1p [out1p out1p out2p CH5C]
                out2p [out1p out2p CH5C])))

        (+process VMCT
          (- coin
             (| choc VMCT
                toffee VMCT)))

        (+process VMC
          (note WARNING: do not insert three pennies in a row.)
          (| in2p (| large VMC
                     small [out1p VMC])
             in1p (| small VMC
                     in1p (| large VMC
                             in1p STOP))))

        (+process COPYBIT
          (| in.0 [out.0 COPYBIT]
             in.1 [out.1 COPYBIT]))

        (note (process (|)) == STOP)

        (+jojo CT (-> :n <nat> -- <process>)
          (cond [:n 0 eq?]
                (| up [1 CT]
                   around [0 CT])
                else
                (| up [:n inc CT]
                   down [:n dec CT])))
        #+end_src

*** 1.2  Pictures

*** 1.3  Laws

