docs/book-notes/CSP/CSP.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-09-28 Thu 01:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Communicating Sequential Processes</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="xieyuheng" />
<link rel="stylesheet" href="../../css/org-page.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Communicating Sequential Processes</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org43f7128">1 Processes</a>
<ul>
<li><a href="#orge5d92b9">1.1  Introduction</a></li>
<li><a href="#org831358e">1.2  Pictures</a></li>
<li><a href="#org4f95b51">1.3  Laws</a></li>
<li><a href="#orgea87d3b">1.4  Implementation of processes</a></li>
<li><a href="#org7766969">1.5  Traces</a></li>
<li><a href="#orgcd7e504">1.6  Operations on traces</a></li>
<li><a href="#org7a30ab4">1.7  Implementation of traces</a></li>
<li><a href="#org812d729">1.8  Traces of a process</a></li>
<li><a href="#orgbffdbd4">1.9  More operations on traces</a></li>
<li><a href="#orgc0e2dc4">1.10 Specifications</a></li>
</ul>
</li>
<li><a href="#org649ecc1">2 concurrency</a>
<ul>
<li><a href="#org83b7113">2.1  introduction</a></li>
<li><a href="#org2081c71">2.2  intersection</a></li>
<li><a href="#orge7363ed">2.3  Concurrency</a></li>
<li><a href="#org48fd609">2.4  Pictures</a></li>
<li><a href="#orgde2909b">2.5  Example: The Dining Philosophers</a></li>
<li><a href="#org149db40">2.6  Change of symbol</a></li>
<li><a href="#org755fa40">2.7  Specifications</a></li>
<li><a href="#org8c1b2cb">2.8  Mathematical theory of deterministic processes</a></li>
</ul>
</li>
<li><a href="#org98e430d">3 Nondeterminism</a>
<ul>
<li><a href="#org199880f">3.1  Introduction</a></li>
<li><a href="#orgb83e2c3">3.2  Nondeterministic or</a></li>
<li><a href="#org790670a">3.3  General choice</a></li>
<li><a href="#org2fa5617">3.4  Refusals</a></li>
<li><a href="#org381c4b0">3.5  Concealment</a></li>
<li><a href="#org200633b">3.6  Interleaving</a></li>
<li><a href="#org76d7091">3.7  Specifications</a></li>
<li><a href="#org770b28">3.8  Divergence</a></li>
<li><a href="#orgd1b0e1f">3.9  Mathematical theory of non-deterministic processes</a></li>
</ul>
</li>
<li><a href="#org40ebd96">4 Communication</a>
<ul>
<li><a href="#org4462117">4.1  Introduction</a></li>
<li><a href="#orgc101073">4.2  Input and output</a></li>
<li><a href="#org9ba5168">4.3  Communications</a></li>
<li><a href="#org1fa43c7">4.4  Pipes</a></li>
<li><a href="#org410f819">4.5  Subordination</a></li>
</ul>
</li>
<li><a href="#org656687e">5 Sequential Processes</a>
<ul>
<li><a href="#orge10355f">5.1  Introduction</a></li>
<li><a href="#orgde582b2">5.2  Laws</a></li>
<li><a href="#org30c7237">5.3  Mathematical treatment</a></li>
<li><a href="#org20c5d9e">5.4  Interrupts</a></li>
<li><a href="#org7c05d16">5.5  Assignment</a></li>
</ul>
</li>
<li><a href="#orgefb4ca9">6 Shared Resources</a>
<ul>
<li><a href="#orgae7a482">6.1  Introduction</a></li>
<li><a href="#orgae7d085">6.2  Sharing by interleaving</a></li>
<li><a href="#orgdb75d8">6.3  Shared storage</a></li>
<li><a href="#orgc894b99">6.4  Multiple resources</a></li>
<li><a href="#org810aa6f">6.5  Operating systems</a></li>
<li><a href="#org8ffae67">6.6  Scheduling</a></li>
</ul>
</li>
<li><a href="#orgd9349c4">7 Discussion</a>
<ul>
<li><a href="#org74dba5f">7.1  Introduction</a></li>
<li><a href="#orgb45b6ef">7.2  Shared storage</a></li>
<li><a href="#org7e62c72">7.3  Communication</a></li>
<li><a href="#org2d25450">7.4  Mathematical models</a></li>
</ul>
</li>
</ul>
</div>
</div>
<ul class="org-ul">
<li><p>by C. A. R. Hoare</p></li></ul>

<div id="outline-container-org43f7128" class="outline-2">
<h2 id="org43f7128">1 Processes</h2>
<div class="outline-text-2" id="text-org43f7128">
</div><div id="outline-container-orge5d92b9" class="outline-3">
<h3 id="orge5d92b9">1.1  Introduction</h3>
<div class="outline-text-3" id="text-orge5d92b9">
<ul class="org-ul">
<li><p>the word 'process' stand for</p><p>the behaviour pattern of an object,</p><p>insofar as it can be described</p><p>in terms of the limited set of events</p><p>selected as its alphabet.</p></li>

<li><p>prefix -</p><p>(x : event) (P : process)</p><p>(x -&gt; P) &#x2013; pronounced "x then P"</p><p></p><p><ul class="org-ul"></p><p><li><p><p></p><p>x -</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+process</span> CLOCK <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">-</span> tick CLOCK<span style="color: #696969;">))</span></p><p><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+process</span> VMS <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">-</span> coin choc VMS<span style="color: #696969;">))</span></p><p></pre></p><p></div></p></li></ul></p></li>

<li><p>choice -</p><p>(x -&gt; P | y -&gt; Q)</p><p>The bar | should be pronounced "choice"</p><p>"x then P choice y then Q"</p><p></p><p><ul class="org-ul"></p><p><li><p><p></p><p>x -</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+process</span> CH5C</p><p>  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">-</span> in5p</p><p>     <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">|</span> out1p <span style="color: #797979;">[</span>out1p out1p out2p CH5C<span style="color: #797979;">]</span></p><p>        out2p <span style="color: #797979;">[</span>out1p out2p CH5C<span style="color: #797979;">]</span><span style="color: #696969;">)))</span></p><p></p><p><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+process</span> VMCT</p><p>  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">-</span> coin</p><p>     <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">|</span> choc VMCT</p><p>        toffee VMCT<span style="color: #696969;">)))</span></p><p></p><p><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+process</span> VMC</p><p>  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> WARNING: do not insert three pennies in a row.<span style="color: #696969;">)</span></p><p>  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">|</span> in2p <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">|</span> large VMC</p><p>             small <span style="color: #797979;">[</span>out1p VMC<span style="color: #797979;">]</span><span style="color: #696969;">)</span></p><p>     in1p <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">|</span> small VMC</p><p>             in1p <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">|</span> large VMC</p><p>                     in1p STOP<span style="color: #696969;">))))</span></p><p></p><p><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+process</span> COPYBIT</p><p>  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">|</span> in.0 <span style="color: #797979;">[</span>out.0 COPYBIT<span style="color: #797979;">]</span></p><p>     in.1 <span style="color: #797979;">[</span>out.1 COPYBIT<span style="color: #797979;">]</span><span style="color: #696969;">))</span></p><p></p><p><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">process</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">|</span><span style="color: #696969;">))</span> == STOP<span style="color: #696969;">)</span></p><p></p><p><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> CT <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:n</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;process&gt;</span><span style="color: #696969;">)</span></p><p>  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:n</span> <span style="color: #ae81ff;">0</span> eq?<span style="color: #797979;">]</span></p><p>        <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">|</span> up <span style="color: #797979;">[</span><span style="color: #ae81ff;">1</span> CT<span style="color: #797979;">]</span></p><p>           around <span style="color: #797979;">[</span><span style="color: #ae81ff;">0</span> CT<span style="color: #797979;">]</span><span style="color: #696969;">)</span></p><p>        <span style="color: #66d9ef; font-weight: bold;">else</span></p><p>        <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">|</span> up <span style="color: #797979;">[</span><span style="color: #a6e22e;">:n</span> inc CT<span style="color: #797979;">]</span></p><p>           down <span style="color: #797979;">[</span><span style="color: #a6e22e;">:n</span> dec CT<span style="color: #797979;">]</span><span style="color: #696969;">)))</span></p><p></pre></p><p></div></p></li></ul></p></li></ul>
</div>
</div>
