docs/book-notes/CSP/CSP.html

<div id="outline-container-org831358e" class="outline-3">
<h3 id="org831358e">1.2  Pictures</h3>
</div>

<div id="outline-container-org4f95b51" class="outline-3">
<h3 id="org4f95b51">1.3  Laws</h3>
</div>

<div id="outline-container-orgea87d3b" class="outline-3">
<h3 id="orgea87d3b">1.4  Implementation of processes</h3>
<div class="outline-text-3" id="text-orgea87d3b">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> stop drop 'bleep<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> process == <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:event</span> <span style="color: #66d9ef; font-weight: bold;">--</span> process<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> prefix <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:event</span> <span style="color: #a6e22e;">:process</span> <span style="color: #66d9ef; font-weight: bold;">--</span> process<span style="color: #696969;">)</span>
  <span style="color: #B380A8;">{</span><span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:x</span> <span style="color: #66d9ef; font-weight: bold;">--</span> process<span style="color: #696969;">)</span>
   <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #a6e22e;">:x</span> <span style="color: #a6e22e;">:event</span> eq?
       <span style="color: #66d9ef; font-weight: bold;">then</span> <span style="color: #a6e22e;">:process</span>
       <span style="color: #66d9ef; font-weight: bold;">else</span> 'bleep<span style="color: #696969;">)</span><span style="color: #B380A8;">}</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> choice2 <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:event1</span> <span style="color: #a6e22e;">:process1</span> <span style="color: #a6e22e;">:event2</span> <span style="color: #a6e22e;">:process2</span> <span style="color: #66d9ef; font-weight: bold;">--</span> process<span style="color: #696969;">)</span>
  <span style="color: #B380A8;">{</span><span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:x</span> <span style="color: #66d9ef; font-weight: bold;">--</span> process<span style="color: #696969;">)</span>
   <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:event1</span> <span style="color: #a6e22e;">:x</span> eq?<span style="color: #797979;">]</span> <span style="color: #a6e22e;">:process1</span>
         <span style="color: #797979;">[</span><span style="color: #a6e22e;">:event2</span> <span style="color: #a6e22e;">:x</span> eq?<span style="color: #797979;">]</span> <span style="color: #a6e22e;">:process2</span>
         <span style="color: #66d9ef; font-weight: bold;">else</span> 'bleep<span style="color: #696969;">)</span><span style="color: #B380A8;">}</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> CT <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> counter<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:n</span> <span style="color: #66d9ef; font-weight: bold;">--</span> process<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:n</span> <span style="color: #ae81ff;">0</span> eq?<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span>'up <span style="color: #B380A8;">{</span><span style="color: #ae81ff;">1</span> CT apply<span style="color: #B380A8;">}</span>
         'around <span style="color: #B380A8;">{</span><span style="color: #ae81ff;">0</span> CT apply<span style="color: #B380A8;">}</span>
         choice2<span style="color: #797979;">]</span>
        <span style="color: #66d9ef; font-weight: bold;">else</span>
        <span style="color: #797979;">[</span>'up <span style="color: #B380A8;">{</span><span style="color: #a6e22e;">:n</span> inc CT apply<span style="color: #B380A8;">}</span>
         'down <span style="color: #B380A8;">{</span><span style="color: #a6e22e;">:n</span> dec CT apply<span style="color: #B380A8;">}</span>
         choice2<span style="color: #797979;">]</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> CT
    <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:n</span> <span style="color: #66d9ef; font-weight: bold;">&lt;nat&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #66d9ef; font-weight: bold;">&lt;process&gt;</span><span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:n</span> <span style="color: #ae81ff;">0</span> eq?<span style="color: #797979;">]</span>
          <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">|</span> up <span style="color: #797979;">[</span><span style="color: #ae81ff;">1</span> CT<span style="color: #797979;">]</span>
             around <span style="color: #797979;">[</span><span style="color: #ae81ff;">0</span> CT<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
          <span style="color: #66d9ef; font-weight: bold;">else</span>
          <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">|</span> up <span style="color: #797979;">[</span><span style="color: #a6e22e;">:n</span> inc CT<span style="color: #797979;">]</span>
             down <span style="color: #797979;">[</span><span style="color: #a6e22e;">:n</span> dec CT<span style="color: #797979;">]</span><span style="color: #696969;">))))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> menu <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:alphabet-list</span> <span style="color: #a6e22e;">:process</span> <span style="color: #66d9ef; font-weight: bold;">--</span> first-event-list<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:alphabet-list</span> null?<span style="color: #797979;">]</span> null

        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:alphabet-list</span> <span style="color: #ae81ff;">.car</span> <span style="color: #a6e22e;">:process</span> apply 'bleep eq?<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:alphabet-list</span> <span style="color: #ae81ff;">.cdr</span> <span style="color: #a6e22e;">:process</span> <span style="color: #66d9ef; font-weight: bold;">recur</span><span style="color: #797979;">]</span>

        <span style="color: #66d9ef; font-weight: bold;">else</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:alphabet-list</span> <span style="color: #ae81ff;">.car</span>
              <span style="color: #a6e22e;">:alphabet-list</span> <span style="color: #ae81ff;">.cdr</span> <span style="color: #a6e22e;">:process</span> <span style="color: #66d9ef; font-weight: bold;">recur</span>
              cons<span style="color: #797979;">]</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span>
    '<span style="color: #696969;">(</span>up down around<span style="color: #696969;">)</span>
    <span style="color: #ae81ff;">0</span> CT
    menu w<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span>
    '<span style="color: #696969;">(</span>up down around<span style="color: #696969;">)</span>
    <span style="color: #ae81ff;">2</span> CT
    menu w<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> interact
  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:alphabet-list</span> <span style="color: #a6e22e;">:process</span> <span style="color: #66d9ef; font-weight: bold;">--</span><span style="color: #696969;">)</span>
  <span style="color: #a6e22e;">:alphabet-list</span> <span style="color: #a6e22e;">:process</span> menu w nl
  read-jo <span style="color: #fd971f;">:jo!</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #a6e22e;">:jo</span> '<span style="color: #66d9ef; font-weight: bold;">end</span> eq? <span style="color: #66d9ef; font-weight: bold;">then</span> <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>
  <span style="color: #a6e22e;">:jo</span> <span style="color: #a6e22e;">:process</span> apply <span style="color: #fd971f;">:next!</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:next</span> 'bleep eq?<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span>'bleep w nl <span style="color: #a6e22e;">:alphabet-list</span> <span style="color: #a6e22e;">:process</span> <span style="color: #66d9ef; font-weight: bold;">recur</span><span style="color: #797979;">]</span>
        <span style="color: #66d9ef; font-weight: bold;">else</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:alphabet-list</span> <span style="color: #a6e22e;">:next</span> <span style="color: #66d9ef; font-weight: bold;">recur</span><span style="color: #797979;">]</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span>
    '<span style="color: #696969;">(</span>up down around<span style="color: #696969;">)</span>
    <span style="color: #ae81ff;">0</span> CT
    interact<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> VMS <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> vending-machine/simple<span style="color: #696969;">)</span>
  'coin 'choc <span style="color: #B380A8;">{</span>VMS apply<span style="color: #B380A8;">}</span>
  prefix
  prefix<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span>
  '<span style="color: #696969;">(</span>coin choc<span style="color: #696969;">)</span>
  VMS
  interact<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7766969" class="outline-3">
<h3 id="org7766969">1.5  Traces</h3>
</div>

<div id="outline-container-orgcd7e504" class="outline-3">
<h3 id="orgcd7e504">1.6  Operations on traces</h3>
</div>

<div id="outline-container-org7a30ab4" class="outline-3">
<h3 id="org7a30ab4">1.7  Implementation of traces</h3>
</div>

<div id="outline-container-org812d729" class="outline-3">
<h3 id="org812d729">1.8  Traces of a process</h3>
</div>

<div id="outline-container-orgbffdbd4" class="outline-3">
<h3 id="orgbffdbd4">1.9  More operations on traces</h3>
</div>

<div id="outline-container-orgc0e2dc4" class="outline-3">
<h3 id="orgc0e2dc4">1.10 Specifications</h3>
</div>
</div>

<div id="outline-container-org649ecc1" class="outline-2">
<h2 id="org649ecc1">2 concurrency</h2>
<div class="outline-text-2" id="text-org649ecc1">
</div><div id="outline-container-org83b7113" class="outline-3">
<h3 id="org83b7113">2.1  introduction</h3>
<div class="outline-text-3" id="text-org83b7113">
<ul class="org-ul">
<li><p>composition of processes.</p></li></ul>
</div>
</div>

<div id="outline-container-org2081c71" class="outline-3">
<h3 id="org2081c71">2.2  intersection</h3>
<div class="outline-text-3" id="text-org2081c71">
<ul class="org-ul">
<li><p>&gt;&lt;</p></li></ul>
</div>
</div>
