docs/book-notes/CSP/CSP.org
*** 2.3  Concurrency

*** 2.4  Pictures

*** 2.5  Example: The Dining Philosophers

*** 2.6  Change of symbol

*** 2.7  Specifications

*** 2.8  Mathematical theory of deterministic processes

* 3 Nondeterminism

*** 3.1  Introduction

*** 3.2  Nondeterministic or

*** 3.3  General choice

*** 3.4  Refusals

*** 3.5  Concealment

*** 3.6  Interleaving

*** 3.7  Specifications

*** 3.8  Divergence

*** 3.9  Mathematical theory of non-deterministic processes

* 4 Communication

*** 4.1  Introduction

*** 4.2  Input and output

*** 4.3  Communications

*** 4.4  Pipes

*** 4.5  Subordination

* 5 Sequential Processes

*** 5.1  Introduction

*** 5.2  Laws

*** 5.3  Mathematical treatment

*** 5.4  Interrupts

*** 5.5  Assignment

* 6 Shared Resources

*** 6.1  Introduction

*** 6.2  Sharing by interleaving

*** 6.3  Shared storage

*** 6.4  Multiple resources

*** 6.5  Operating systems

*** 6.6  Scheduling

* 7 Discussion

*** 7.1  Introduction

*** 7.2  Shared storage

*** 7.3  Communication

*** 7.4  Mathematical models
