docs/book-notes/CSP/CSP.html

<div id="outline-container-orge7363ed" class="outline-3">
<h3 id="orge7363ed">2.3  Concurrency</h3>
</div>

<div id="outline-container-org48fd609" class="outline-3">
<h3 id="org48fd609">2.4  Pictures</h3>
</div>

<div id="outline-container-orgde2909b" class="outline-3">
<h3 id="orgde2909b">2.5  Example: The Dining Philosophers</h3>
</div>

<div id="outline-container-org149db40" class="outline-3">
<h3 id="org149db40">2.6  Change of symbol</h3>
</div>

<div id="outline-container-org755fa40" class="outline-3">
<h3 id="org755fa40">2.7  Specifications</h3>
</div>

<div id="outline-container-org8c1b2cb" class="outline-3">
<h3 id="org8c1b2cb">2.8  Mathematical theory of deterministic processes</h3>
</div>
</div>

<div id="outline-container-org98e430d" class="outline-2">
<h2 id="org98e430d">3 Nondeterminism</h2>
<div class="outline-text-2" id="text-org98e430d">
</div><div id="outline-container-org199880f" class="outline-3">
<h3 id="org199880f">3.1  Introduction</h3>
</div>

<div id="outline-container-orgb83e2c3" class="outline-3">
<h3 id="orgb83e2c3">3.2  Nondeterministic or</h3>
</div>

<div id="outline-container-org790670a" class="outline-3">
<h3 id="org790670a">3.3  General choice</h3>
</div>

<div id="outline-container-org2fa5617" class="outline-3">
<h3 id="org2fa5617">3.4  Refusals</h3>
</div>

<div id="outline-container-org381c4b0" class="outline-3">
<h3 id="org381c4b0">3.5  Concealment</h3>
</div>

<div id="outline-container-org200633b" class="outline-3">
<h3 id="org200633b">3.6  Interleaving</h3>
</div>

<div id="outline-container-org76d7091" class="outline-3">
<h3 id="org76d7091">3.7  Specifications</h3>
</div>

<div id="outline-container-org770b28" class="outline-3">
<h3 id="org770b28">3.8  Divergence</h3>
</div>

<div id="outline-container-orgd1b0e1f" class="outline-3">
<h3 id="orgd1b0e1f">3.9  Mathematical theory of non-deterministic processes</h3>
</div>
</div>

<div id="outline-container-org40ebd96" class="outline-2">
<h2 id="org40ebd96">4 Communication</h2>
<div class="outline-text-2" id="text-org40ebd96">
</div><div id="outline-container-org4462117" class="outline-3">
<h3 id="org4462117">4.1  Introduction</h3>
</div>

<div id="outline-container-orgc101073" class="outline-3">
<h3 id="orgc101073">4.2  Input and output</h3>
</div>

<div id="outline-container-org9ba5168" class="outline-3">
<h3 id="org9ba5168">4.3  Communications</h3>
</div>

<div id="outline-container-org1fa43c7" class="outline-3">
<h3 id="org1fa43c7">4.4  Pipes</h3>
</div>

<div id="outline-container-org410f819" class="outline-3">
<h3 id="org410f819">4.5  Subordination</h3>
</div>
</div>

<div id="outline-container-org656687e" class="outline-2">
<h2 id="org656687e">5 Sequential Processes</h2>
<div class="outline-text-2" id="text-org656687e">
</div><div id="outline-container-orge10355f" class="outline-3">
<h3 id="orge10355f">5.1  Introduction</h3>
</div>

<div id="outline-container-orgde582b2" class="outline-3">
<h3 id="orgde582b2">5.2  Laws</h3>
</div>

<div id="outline-container-org30c7237" class="outline-3">
<h3 id="org30c7237">5.3  Mathematical treatment</h3>
</div>

<div id="outline-container-org20c5d9e" class="outline-3">
<h3 id="org20c5d9e">5.4  Interrupts</h3>
</div>

<div id="outline-container-org7c05d16" class="outline-3">
<h3 id="org7c05d16">5.5  Assignment</h3>
</div>
</div>

<div id="outline-container-orgefb4ca9" class="outline-2">
<h2 id="orgefb4ca9">6 Shared Resources</h2>
<div class="outline-text-2" id="text-orgefb4ca9">
</div><div id="outline-container-orgae7a482" class="outline-3">
<h3 id="orgae7a482">6.1  Introduction</h3>
</div>

<div id="outline-container-orgae7d085" class="outline-3">
<h3 id="orgae7d085">6.2  Sharing by interleaving</h3>
</div>

<div id="outline-container-orgdb75d8" class="outline-3">
<h3 id="orgdb75d8">6.3  Shared storage</h3>
</div>

<div id="outline-container-orgc894b99" class="outline-3">
<h3 id="orgc894b99">6.4  Multiple resources</h3>
</div>

<div id="outline-container-org810aa6f" class="outline-3">
<h3 id="org810aa6f">6.5  Operating systems</h3>
</div>

<div id="outline-container-org8ffae67" class="outline-3">
<h3 id="org8ffae67">6.6  Scheduling</h3>
</div>
</div>

<div id="outline-container-orgd9349c4" class="outline-2">
<h2 id="orgd9349c4">7 Discussion</h2>
<div class="outline-text-2" id="text-orgd9349c4">
</div><div id="outline-container-org74dba5f" class="outline-3">
<h3 id="org74dba5f">7.1  Introduction</h3>
</div>

<div id="outline-container-orgb45b6ef" class="outline-3">
<h3 id="orgb45b6ef">7.2  Shared storage</h3>
</div>

<div id="outline-container-org7e62c72" class="outline-3">
<h3 id="org7e62c72">7.3  Communication</h3>
</div>

<div id="outline-container-org2d25450" class="outline-3">
<h3 id="org2d25450">7.4  Mathematical models</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: xieyuheng</p>
<p class="date">Created: 2017-09-28 Thu 01:15</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
